BwanaFr/LittlevGL_Experiments/src/ESP32_TFT.cpp
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
uint8_t	RA8875::readStatus(void) 
{
	return _readData(true);
}

/**************************************************************************/
/*! PRIVATE
		Write a command
		Parameters:
		d: the command
*/
/**************************************************************************/
void RA8875::writeCommand(const uint8_t d) 
{
	_startSend();
	#if defined(___DUESTUFF) && defined(SPI_DUE_MODE_EXTENDED)
		SPI.transfer(_cs, RA8875_CMDWRITE, SPI_CONTINUE); 
		SPI.transfer(_cs, d, SPI_LAST);
	#else
		#if (defined(__AVR__) && defined(_FASTSSPORT)) || defined(SPARK)
			_spiwrite(RA8875_CMDWRITE);
			_spiwrite(d);
		#else
			#if defined(SPI_HAS_TRANSACTION) && defined(__MKL26Z64__)	
				if (_altSPI){
					SPI1.transfer(RA8875_CMDWRITE);
					SPI1.transfer(d);
				} else {
					SPI.transfer(RA8875_CMDWRITE);
					SPI.transfer(d);
				}
			#else
				SPI.transfer(RA8875_CMDWRITE);
				SPI.transfer(d);
			#endif
		#endif
	#endif
	_endSend();
}


/*
 void RA8875::debugData(uint16_t data,uint8_t len)
{
	int i;
	for (i=len-1; i>=0; i--){
		if (bitRead(data,i)==1){
			Serial.print("1");
		} else {
			Serial.print("0");
		}
	}
	Serial.print(" -> 0x");
	Serial.print(data,HEX);
	Serial.print("\n");
} 
*/

/*
 void RA8875::showLineBuffer(uint8_t data[],int len)
{
	int i;
	for (i=0; i<len; i++){
		if (data[i] == 1){
			Serial.print("1");
		} else {
			Serial.print("0");
		}
	}
	Serial.print("\n");
} 
*/

#if defined(EEPROM_SUPPORTED)
/**************************************************************************/
/*!
    Read from the EEPROM location
 
    @param location The location of the EEPROM to read
 
    @return The value
*/
/**************************************************************************/

uint32_t RA8875::eepromReadS32(int location)
{
    uint32_t value = ((uint32_t)EEPROM.read(location))<<24;
    value = value | ((uint32_t)EEPROM.read(location+1))<<16;
    value = value | ((uint32_t)EEPROM.read(location+2))<<8;
    value = value | ((uint32_t)EEPROM.read(location+3));
    return value;
}

/**************************************************************************/
/*!
    Write to the EEPROM location
 
    @param location The location of the EEPROM to write to
    @param value The value to write
 */
/**************************************************************************/
void RA8875::eepromWriteS32(int location, int32_t value)
{
    EEPROM.write(location,   (value >> 24)&0xff);
    EEPROM.write(location+1, (value >> 16)&0xff);
    EEPROM.write(location+2, (value >> 8)&0xff);
    EEPROM.write(location+3, (value )&0xff);
}

/**************************************************************************/
/*!
     Read Calibration Data from the EEPROM location

     @param location The location of the EEPROM to read from
     @param matrixPtr The pointer to the Matrix Variable
 
     @return success
 */
/**************************************************************************/
bool RA8875::readCalibration(int location, tsMatrix_t * matrixPtr)
{
    if (location+sizeof(tsMatrix_t) > EEPROMSIZE){
        return false; //readCalibration::Calibration location outside of EEPROM memory bound
    }
    if (EEPROM.read(location+CFG_EEPROM_TOUCHSCREEN_CALIBRATED) == 1){
        matrixPtr->An = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_AN);
        matrixPtr->Bn = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_BN);
        matrixPtr->Cn = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_CN);
        matrixPtr->Dn = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_DN);
        matrixPtr->En = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_EN);
        matrixPtr->Fn = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_FN);
        matrixPtr->Divider = eepromReadS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_DIVIDER);
        return true;
    }
    return false;
}

/**************************************************************************/
/*!
     Write Calibration Data to the EEPROM location
 
     @param location The location of the EEPROM to write to
     @param matrixPtr The pointer to the Matrix Variable
 */
/**************************************************************************/
void RA8875::writeCalibration(int location, tsMatrix_t * matrixPtr)
{
    if (location+sizeof(tsMatrix_t) < EEPROMSIZE){    // Check to see it calibration location outside of EEPROM memory bound
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_AN, matrixPtr->An);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_BN, matrixPtr->Bn);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_CN, matrixPtr->Cn);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_DN, matrixPtr->Dn);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_EN, matrixPtr->En);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_FN, matrixPtr->Fn);
        eepromWriteS32(location+CFG_EEPROM_TOUCHSCREEN_CAL_DIVIDER, matrixPtr->Divider);
        EEPROM.write(location+CFG_EEPROM_TOUCHSCREEN_CALIBRATED, 1);
    }
}
#endif
